{
    "tiger": {
        "commonName": "Bengal Tiger",
        "scientificName": "Panthera tigris tigris",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Endangered (IUCN)",
        "seasonalVariations": {
            "summer": "Lighter coat, more active during dawn/dusk",
            "winter": "Denser fur, more visible stripes in low light",
            "monsoon": "Increased water activity, mud bath behavior"
        },
        "behavior": "Bengal Tigers are solitary animals, primarily nocturnal, with large territorial ranges marked through scent marking and vocalizations. They are skilled swimmers and maintain dominance through complex social signals.",
        "diet": "Carnivore. Primary food sources include deer, wild boar, and water buffalo. They use ambush hunting strategies and are capable of taking down prey much larger than themselves.",
        "nature": "Generally shy and avoid human contact but become highly defensive and aggressive if threatened, cornered, or during mating season. Territorial and unpredictable when sick.",
        "habitat": "Tropical forests, mangroves, and grasslands. Apex predators regulating herbivore populations and maintaining ecological balance across the Indian subcontinent.",
        "biometrics": {
            "massRange": "90 - 310 kg",
            "lifespan": "10 - 15 years",
            "dimensions": "2.5 - 3.9 meters (Length)"
        },
        "threatDossier": {
            "status": "Critically Vulnerable",
            "primaryThreats": [
                "Habitat Fragmentation",
                "Poaching for skins/bones",
                "Human-Wildlife Conflict"
            ],
            "protectionLevel": "Schedule I (WPA)"
        },
        "trophicLevel": "Apex Predator",
        "evsAlignment": "Biodiversity and species adaptation, Food webs and trophic relationships."
    },
    "peafowl": {
        "commonName": "Indian Peafowl",
        "scientificName": "Pavo cristatus",
        "taxonomy": "Bird",
        "group": "Birds",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "seasonalVariations": {
            "spring": "Males in full breeding plumage, intense courtship displays",
            "summer": "Molt begins, tail feathers start shedding",
            "winter": "Post-molt appearance, duller plumage until spring"
        },
        "behavior": "Generally tolerant of human presence in their natural range but become defensive during nesting season. Diurnal birds known for their elaborate courtship displays and loud alarm calls.",
        "diet": "Omnivore. Feed on seeds, insects, fruits, and small reptiles. Opportunistic foragers that play a key role in seed dispersal within their forest ecosystems.",
        "nature": "Shy but adaptive. Often found near human settlements. Recognized for the iridescent plumage and the iconic tail-fanning behavior of males during mating.",
        "habitat": "Open forests, woodland, and cultivated fields. Distributed widely across the Indian subcontinent. Symbolizes forest health and ecosystem interdependence.",
        "evsAlignment": "Ecosystem interdependence, Human-wildlife coexistence."
    },
    "fox": {
        "commonName": "Red Fox",
        "scientificName": "Vulpes vulpes",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "curious",
        "status": "Least Concern (IUCN)",
        "seasonalVariations": {
            "winter": "Thicker winter fur, more visible bushy tail",
            "spring": "Spring molt, lighter coat",
            "summer": "Minimal fur, increased nocturnal activity"
        },
        "behavior": "Crepuscular or nocturnal. Solitary hunters with complex social structures during breeding. Known for high intelligence and ability to vocalize over 28 different sounds.",
        "diet": "Red Foxes are omnivorous opportunistic feeders, consuming small mammals, birds, insects, fruits, and carrion depending on seasonal availability and habitat.",
        "nature": "Highly curious and adaptive. While naturally cautious, they can become habituated to human presence in urban-fringe areas. High maternal instincts.",
        "habitat": "Diverse range from forests and grasslands to mountains and urban areas. Play a critical role as opportunistic predators controlling rodent populations.",
        "evsAlignment": "Adaptation to urban environments, Predator-prey dynamics."
    },
    "cobra": {
        "commonName": "King Cobra",
        "scientificName": "Ophiophagus hannah",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "behavior": "Diurnal predator, uniquely feeds almost exclusively on other snakes. Known for building nests for eggs and exhibiting parental care unlike most cobras.",
        "diet": "Ophiophagous (snake-eater). Feeds on rat snakes, small pythons, and other venomous snakes using neurotoxic venom.",
        "nature": "Highly intelligent and alert. Defensive but avoids humans; however, if cornered, it can deliver a massive amount of venom through its large fangs.",
        "habitat": "Dense forests, bamboo thickets, and near streams. Found across Southeast and South Asia. Roles include controlling other snake populations.",
        "biometrics": {
            "massRange": "Up to 6 kg",
            "lifespan": "20+ years",
            "dimensions": "3.1 - 4.0 meters (Average)"
        },
        "threatDossier": {
            "status": "Vulnerable",
            "primaryThreats": [
                "Deforestation",
                "Illegal harvest for skin/medicine"
            ],
            "protectionLevel": "International Trade Restrictions"
        },
        "trophicLevel": "Ophiophagous Predator",
        "evsAlignment": "Specialized predatory strategies, Biodiversity in reptiles."
    },
    "elephant": {
        "commonName": "Asian Elephant",
        "scientificName": "Elephas maximus",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Endangered (IUCN)",
        "seasonalVariations": {
            "summer": "Increased water activities, mud wallowing frequency",
            "monsoon": "Most active movement period, new vegetation availability",
            "winter": "Extended foraging time, migration to lower elevations"
        },
        "behavior": "Highly social animals living in matriarchal groups. Exhibit complex emotions, problem-solving skills, and long-term memory.",
        "diet": "Herbivore. Consumes up to 150kg of vegetation daily, including grass, bark, roots, and fruits. Frequent water consumption required.",
        "nature": "Generally peaceful but can be extremely dangerous if provoked, in musth, or protecting young. Use vocalizations and low-frequency infrasound.",
        "habitat": "Forests, scrublands, and grasslands. Ecosystem engineers that create paths and disperse seeds over vast distances.",
        "biometrics": {
            "massRange": "2,000 - 5,000 kg",
            "lifespan": "60 - 70 years",
            "dimensions": "2.7 - 3.0 meters (Shoulder Height)"
        },
        "threatDossier": {
            "status": "Endangered",
            "primaryThreats": [
                "Poaching for ivory",
                "Habitat loss",
                "Linear infrastructure barriers"
            ],
            "protectionLevel": "High Priority Conservation"
        },
        "trophicLevel": "Mega-Herbivore / Keystone Species",
        "evsAlignment": "Keystone species, Human-wildlife conflict management."
    },
    "leopard": {
        "commonName": "Indian Leopard",
        "scientificName": "Panthera pardus fusca",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "seasonalVariations": {
            "summer": "More visible near water sources",
            "winter": "Thicker fur, increased nocturnal hunting",
            "monsoon": "Improved camouflage in wet vegetation"
        },
        "behavior": "Solitary and nocturnal. Remarkable for climbing ability and strength, often hauling heavy prey into trees to protect it from other predators.",
        "diet": "Carnivore. Highly opportunistic foragers with a broad diet including small primates, deer, pigs, and occasionally domestic animals.",
        "nature": "Extremely stealthy and adaptable. Known for 'leopard-human' conflict in fringe areas. Highly territorial and evasive.",
        "habitat": "Woodlands, scrub forests, and sometimes urban fringes. Occupy a wide variety of habitats across India.",
        "evsAlignment": "Adaptability and urban wildlife conflicts."
    },
    "bear": {
        "commonName": "Sloth Bear",
        "scientificName": "Melursus ursinus",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "behavior": "Primarily nocturnal. Specialized for eating termites and ants using long curved claws and a gap in front teeth for suction.",
        "diet": "Insectivore/Omnivore. Primarily termites, ants, and fruits (like Mahua). Known for 'vocal' feeding style.",
        "nature": "Unpredictable and defensive. Can be more aggressive toward humans than other bears due to historical pressure from large cats.",
        "habitat": "Tropical forests and grasslands. Primarily found in the Indian subcontinent.",
        "evsAlignment": "Specialized anatomical adaptations for feeding."
    },
    "bustard": {
        "commonName": "Great Indian Bustard",
        "scientificName": "Ardeotis nigriceps",
        "taxonomy": "Bird",
        "group": "Birds",
        "safetyType": "shy",
        "status": "Critically Endangered (IUCN)",
        "behavior": "One of the heaviest flying birds. Known for Gulping behavior and display rituals in grasslands. Highly sensitive to human disturbance.",
        "diet": "Omnivore. Insects, small reptiles, seeds, and berries. Plays a role in pest control in grassland ecosystems.",
        "nature": "Extremely shy. Ground-nesting birds that are highly vulnerable to habitat loss and power line collisions.",
        "habitat": "Arid and semi-arid grasslands. Primarily found in Rajasthan and Gujarat.",
        "evsAlignment": "Extinction risks and conservation of grasslands."
    },
    "gharial": {
        "commonName": "Gharial",
        "scientificName": "Gavialis gangeticus",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "shy",
        "status": "Critically Endangered (IUCN)",
        "behavior": "Distinguished by long thin snout. Spend most time in water; move awkwardly on land. Males develop 'ghara' (pot) on snout tip at maturity.",
        "diet": "Piscivore (fish-eater). Specialized snout reduces water resistance during rapid side-sweeps to catch fish.",
        "nature": "Generally non-aggressive toward humans. Highly specialized and sensitive to river pollution and dam construction.",
        "habitat": "Deep fast-flowing rivers with sand banks. Once found across major North Indian river systems.",
        "evsAlignment": "Aquatic ecosystem health and specialized evolution."
    },
    "snow_leopard": {
        "commonName": "Snow Leopard",
        "scientificName": "Panthera uncia",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "shy",
        "status": "Vulnerable (IUCN)",
        "behavior": "The 'Ghost of the Mountains'. Solitary and crepuscular. Uses long thick tail for balance on rocky terrain and as a wrapping during sleep.",
        "diet": "Carnivore. Primarily blue sheep (bharal) and ibex. Capable of making massive leaps in mountain terrain.",
        "nature": "Extremely elusive and shy. Well-camouflaged for high-altitude environments. Rarely seen by humans.",
        "habitat": "Alpine and subalpine zones (3,000–4,500m elevation). Range includes the Himalayas.",
        "evsAlignment": "High-altitude adaptations and climate change impacts."
    },
    "pangolin": {
        "commonName": "Indian Pangolin",
        "scientificName": "Manis crassicaudata",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Endangered (IUCN)",
        "behavior": "Nocturnal and fossorial (burrowing). Rolls into a tight ball when threatened, protected by overlapping keratin scales.",
        "diet": "Myrmecophagous (ant/termite eater). Uses powerful claws and long sticky tongue to forage.",
        "nature": "Gentle and solitary. Most trafficked mammal in the world due to demand for scales and meat.",
        "habitat": "Forests, hills, and plains. Found across India except high Himalayas and northeastern regions.",
        "evsAlignment": "Wildlife trafficking and biodiversity loss."
    },
    "red_panda": {
        "commonName": "Red Panda",
        "scientificName": "Ailurus fulgens",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Endangered (IUCN)",
        "behavior": "Solitary and arboreal. Uses ringed tail for balance and warmth. Crepuscular (active at dawn and dusk).",
        "diet": "Primarily bamboo. Also eats fruits, acorns, and occasionally eggs. Has a 'false thumb' for gripping bamboo.",
        "nature": "Quiet and agile. Not closely related to giant pandas; they belong to their own unique family Ailuridae.",
        "habitat": "High-altitude temperate forests with bamboo understory. Found in Northeast India.",
        "evsAlignment": "Indicator species for forest health."
    },
    "sambar": {
        "commonName": "Sambar Deer",
        "scientificName": "Rusa unicolor",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "shy",
        "status": "Vulnerable (IUCN)",
        "behavior": "Primarily nocturnal and crepuscular. Live in small herds. Males are solitary except during mating. Known for loud alarm calls.",
        "diet": "Herbivore. Browser feeding on leaves, shoots, grasses, and fruits. Important seed dispersers in forest ecosystems.",
        "nature": "Generally shy but can be aggressive when cornered. Stags can be dangerous during rutting season with their large antlers.",
        "habitat": "Dense forests near water sources. Prefer hilly terrain. Found across India in protected forests.",
        "evsAlignment": "Prey species dynamics, Forest ecosystem balance."
    },
    "wolf": {
        "commonName": "Indian Wolf",
        "scientificName": "Canis lupus pallipes",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "aggressive",
        "status": "Endangered (IUCN)",
        "seasonalVariations": {
            "winter": "Pup breeding season, increased pack activity",
            "summer": "Extended nocturnal hunting, water dependency",
            "monsoon": "Improved prey availability in grasslands"
        },
        "behavior": "Pack hunters with complex social hierarchies. Primarily nocturnal. Smaller and less aggressive than northern wolves but highly territorial.",
        "diet": "Carnivore. Hunts blackbuck, hares, rodents, and occasionally livestock. Cooperative hunting strategies.",
        "nature": "Wary of humans but can be dangerous in packs. Critical role in controlling herbivore populations in grasslands.",
        "habitat": "Semi-arid grasslands and scrub forests. Adapted to hot climates unlike other wolf subspecies.",
        "evsAlignment": "Top predator in grassland ecosystems, Human-wildlife conflict."
    },
    "nilgai": {
        "commonName": "Nilgai (Blue Bull)",
        "scientificName": "Boselaphus tragocamelus",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "seasonalVariations": {
            "summer": "Increased water hole visits, early morning activity",
            "monsoon": "Improved forage availability, extended grazing periods",
            "winter": "Longer daily activity, migration to lower areas"
        },
        "behavior": "Diurnal grazers. Males are territorial. Live in small groups. Can run at speeds up to 80 km/h when threatened.",
        "diet": "Herbivore. Grasses, leaves, fruits, and agricultural crops. Considered agricultural pests in some regions.",
        "nature": "Generally docile but males can be aggressive during mating season. Largest Asian antelope.",
        "habitat": "Open grasslands, light forests, and agricultural areas. Highly adaptable to human-modified landscapes.",
        "evsAlignment": "Human-wildlife coexistence, Agricultural impact."
    },
    "blackbuck": {
        "commonName": "Blackbuck",
        "scientificName": "Antilope cervicapra",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "seasonalVariations": {
            "spring": "Males in peak breeding condition, darker coloration",
            "summer": "Reduced activity during peak heat",
            "winter": "Post-breeding season, herd aggregation"
        },
        "behavior": "Highly social, living in herds. Males are territorial with distinctive spiral horns. Known for spectacular leaping displays.",
        "diet": "Herbivore. Primarily grasses and occasionally browse on shrubs. Prefer short grass plains.",
        "nature": "Extremely fast runners (up to 80 km/h). Shy and alert. Males display aggressive territorial behavior.",
        "habitat": "Open grasslands and lightly forested areas. Indicator species for healthy grassland ecosystems.",
        "evsAlignment": "Grassland conservation, Speed adaptations."
    },
    "mugger": {
        "commonName": "Mugger Crocodile",
        "scientificName": "Crocodylus palustris",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "behavior": "Ambush predators. Can tolerate saltwater but prefer freshwater. Bask on banks to thermoregulate. Maternal care of hatchlings.",
        "diet": "Carnivore. Fish, turtles, birds, and mammals. Opportunistic feeders with powerful jaws (bite force ~1,700 PSI).",
        "nature": "Highly dangerous to humans. Responsible for occasional attacks in rural areas. Territorial and aggressive.",
        "habitat": "Rivers, lakes, marshes across Indian subcontinent. Ecosystem engineers creating microhabitats.",
        "evsAlignment": "Apex aquatic predator, Wetland ecosystem health."
    },
    "eagle_owl": {
        "commonName": "Indian Eagle Owl",
        "scientificName": "Bubo bengalensis",
        "taxonomy": "Bird",
        "group": "Birds",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "behavior": "Nocturnal apex predator. Territorial with distinctive deep hooting calls. Monogamous pairs defend territories year-round.",
        "diet": "Carnivore. Rodents, hares, birds, reptiles, and large insects. Silent flight due to specialized feather structure.",
        "nature": "Generally avoid humans. Can be aggressive when defending nests. Powerful talons capable of taking prey larger than themselves.",
        "habitat": "Rocky hills, scrub forests, and semi-desert regions. Adaptable to human presence if undisturbed.",
        "evsAlignment": "Nocturnal predator niche, Rodent population control."
    },
    "monal": {
        "commonName": "Himalayan Monal",
        "scientificName": "Lophophorus impejanus",
        "taxonomy": "Bird",
        "group": "Birds",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "behavior": "National bird of Nepal. Diurnal ground foragers. Males have iridescent plumage. Monogamous during breeding season.",
        "diet": "Omnivore. Roots, tubers, seeds, insects, and small invertebrates. Use strong beaks to dig in soil.",
        "nature": "Extremely shy and wary. Difficult to observe in wild. Males perform elaborate courtship displays.",
        "habitat": "High-altitude Himalayan forests and alpine meadows (2,400-4,500m). Indicator of pristine mountain ecosystems.",
        "evsAlignment": "High-altitude biodiversity, Climate change indicators."
    },
    "python": {
        "commonName": "Indian Rock Python",
        "scientificName": "Python molurus",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "shy",
        "status": "Near Threatened (IUCN)",
        "behavior": "Non-venomous constrictor. Primarily nocturnal. Excellent swimmers. Can go months without food after large meal.",
        "diet": "Carnivore. Mammals, birds, and reptiles. Ambush predators using heat-sensing pits. Constrict prey before swallowing whole.",
        "nature": "Generally docile unless threatened. Not aggressive toward humans. Important rodent population controllers.",
        "habitat": "Forests, grasslands, river valleys, and marshes. Declining due to habitat loss and illegal wildlife trade.",
        "evsAlignment": "Constrictor adaptations, Wildlife trafficking awareness."
    },
    "gaur": {
        "commonName": "Indian Gaur (Bison)",
        "scientificName": "Bos gaurus",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "behavior": "Largest wild cattle species. Live in herds led by females. Bulls are solitary or form bachelor groups. Most active during early morning and late afternoon.",
        "diet": "Herbivore. Grasses, leaves, fruits, and bark. Require large quantities of water daily. Important seed dispersers in forest ecosystems.",
        "nature": "Generally shy but extremely dangerous when threatened or injured. Bulls can be aggressive during mating season. Powerful and unpredictable.",
        "habitat": "Dense forests and grasslands in hilly terrain. Found in Western Ghats and Central India. Prefer areas with water sources.",
        "evsAlignment": "Megaherbivore ecology, Forest-grassland interface dynamics."
    },
    "hyena": {
        "commonName": "Striped Hyena",
        "scientificName": "Hyaena hyaena",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Near Threatened (IUCN)",
        "behavior": "Primarily nocturnal and solitary. Known for distinctive sloping back. Use vocalizations and scent marking for communication. Excellent scavengers.",
        "diet": "Omnivore/Scavenger. Carrion, small mammals, fruits, and insects. Powerful jaws can crush bones. Important ecosystem cleaners.",
        "nature": "Generally avoid humans. Shy and wary. Play crucial role in disease control by consuming carcasses. Often misunderstood due to folklore.",
        "habitat": "Arid and semi-arid regions, scrub forests, and grasslands. Adaptable to various habitats across India.",
        "evsAlignment": "Scavenger ecology, Decomposition and nutrient cycling."
    },
    "rhino": {
        "commonName": "Indian Rhinoceros (One-Horned Rhino)",
        "scientificName": "Rhinoceros unicornis",
        "taxonomy": "Mammal",
        "group": "Large Mammals",
        "safetyType": "aggressive",
        "status": "Vulnerable (IUCN)",
        "behavior": "Solitary except mothers with calves. Excellent swimmers. Use mud wallowing for thermoregulation and parasite control. Territorial with dung piles.",
        "diet": "Herbivore. Grasses, leaves, fruits, and aquatic plants. Consume up to 150kg of vegetation daily. Prehensile upper lip for selective feeding.",
        "nature": "Unpredictable and can be extremely aggressive. Capable of charging at 55 km/h. Poor eyesight but excellent hearing and smell.",
        "habitat": "Tall grasslands and riverine forests. Primarily found in Kaziranga and other protected areas in Northeast India.",
        "evsAlignment": "Megafauna conservation, Grassland ecosystem engineering."
    },
    "clouded_leopard": {
        "commonName": "Clouded Leopard",
        "scientificName": "Neofelis nebulosa",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Vulnerable (IUCN)",
        "behavior": "Highly arboreal and secretive. Excellent climbers with rotating ankle joints. Primarily nocturnal. Solitary hunters with large canine teeth relative to body size.",
        "diet": "Carnivore. Primates, birds, deer, and wild pigs. Hunt both in trees and on ground. Ambush predators with powerful bite.",
        "nature": "Extremely elusive and rarely seen. Avoid human contact. Named for distinctive cloud-like markings on coat.",
        "habitat": "Dense tropical and subtropical forests. Found in Northeast India. Require continuous forest canopy.",
        "evsAlignment": "Arboreal predator adaptations, Forest canopy ecosystems."
    },
    "dhole": {
        "commonName": "Dhole (Indian Wild Dog)",
        "scientificName": "Cuon alpinus",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Endangered (IUCN)",
        "behavior": "Highly social pack hunters with complex vocalizations. Cooperative breeding with dominant pair. Diurnal hunters unlike most canids.",
        "diet": "Carnivore. Medium to large ungulates. Pack hunting allows them to take down prey much larger than themselves. Efficient hunters with 80% success rate.",
        "nature": "Generally avoid humans. Fearless when hunting in packs. Important apex predators in forest ecosystems. Distinctive whistling calls.",
        "habitat": "Dense forests and grasslands. Found across Indian protected areas. Require large territories with abundant prey.",
        "evsAlignment": "Pack hunting strategies, Apex predator dynamics."
    },
    "fishing_cat": {
        "commonName": "Fishing Cat",
        "scientificName": "Prionailurus viverrinus",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Vulnerable (IUCN)",
        "behavior": "Semi-aquatic wild cat. Excellent swimmers with partially webbed paws. Primarily nocturnal. Solitary and territorial.",
        "diet": "Carnivore. Primarily fish, but also crustaceans, frogs, snakes, and birds. Unique among cats for fishing behavior. Tap water surface to attract fish.",
        "nature": "Elusive and rarely seen. Aggressive when cornered. Specialized for wetland habitats. Twice the size of domestic cats.",
        "habitat": "Wetlands, mangroves, and riverine areas. Found in coastal regions and river deltas. Critically dependent on wetland conservation.",
        "evsAlignment": "Wetland specialist adaptations, Aquatic ecosystem health."
    },
    "giant_squirrel": {
        "commonName": "Indian Giant Squirrel (Malabar Giant Squirrel)",
        "scientificName": "Ratufa indica",
        "taxonomy": "Mammal",
        "group": "Small Mammals",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "behavior": "Arboreal and diurnal. Build multiple large nests (dreys) in tree canopy. Solitary or in pairs. Excellent jumpers covering 6m between trees.",
        "diet": "Herbivore. Fruits, flowers, bark, and insects. Important seed dispersers for many forest tree species. Food caching behavior.",
        "nature": "Shy and alert. Freeze when threatened. Distinctive large size (up to 1m including tail) and colorful coat. State animal of Maharashtra.",
        "habitat": "Dense tropical forests of Western Ghats. Strictly arboreal, rarely descend to ground. Indicator of healthy forest ecosystems.",
        "evsAlignment": "Seed dispersal ecology, Arboreal mammal diversity."
    },
    "sarus_crane": {
        "commonName": "Sarus Crane",
        "scientificName": "Antigone antigone",
        "taxonomy": "Bird",
        "group": "Birds",
        "safetyType": "shy",
        "status": "Vulnerable (IUCN)",
        "behavior": "Tallest flying bird. Monogamous pairs mate for life with elaborate dancing displays. Highly territorial during breeding. Vocal with trumpeting calls.",
        "diet": "Omnivore. Aquatic plants, insects, crustaceans, small vertebrates, and grains. Forage in shallow wetlands and agricultural fields.",
        "nature": "Generally shy but can be aggressive when defending nests. Revered in Indian culture. Pairs perform synchronized dances.",
        "habitat": "Wetlands, marshes, and agricultural fields. Found across northern India. Require shallow water bodies for feeding and nesting.",
        "evsAlignment": "Wetland conservation, Agricultural ecosystem integration."
    },
    "monitor": {
        "commonName": "Bengal Monitor Lizard",
        "scientificName": "Varanus bengalensis",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "shy",
        "status": "Least Concern (IUCN)",
        "behavior": "Diurnal and terrestrial. Excellent swimmers and climbers. Use powerful tail as whip for defense. Solitary except during breeding.",
        "diet": "Carnivore. Insects, crabs, fish, frogs, snakes, birds, eggs, and small mammals. Opportunistic foragers with keen sense of smell.",
        "nature": "Generally avoid humans but can bite and use tail whip if cornered. Non-venomous. Important pest controllers in agricultural areas.",
        "habitat": "Diverse habitats from forests to urban areas. Found throughout India. Often near water bodies. Burrow dwellers.",
        "evsAlignment": "Reptile ecology, Human-wildlife coexistence in urban areas."
    },
    "viper": {
        "commonName": "Russell's Viper",
        "scientificName": "Daboia russelii",
        "taxonomy": "Reptile",
        "group": "Reptiles",
        "safetyType": "aggressive",
        "status": "Least Concern (IUCN)",
        "behavior": "Primarily nocturnal. Terrestrial and slow-moving. Known for loud hissing when threatened. Viviparous (gives birth to live young).",
        "diet": "Carnivore. Rodents, lizards, frogs, and scorpions. Ambush predators with heat-sensing pits. Important rodent population controllers.",
        "nature": "Highly venomous and responsible for most snakebite deaths in India. Aggressive when disturbed. Distinctive chain-like pattern on back.",
        "habitat": "Grasslands, scrub forests, and agricultural areas. Found throughout India except Northeast. Often near human habitation.",
        "evsAlignment": "Venomous snake ecology, Human-wildlife conflict and safety."
    }
}